tutorials/A.Jacobsen-2026/NeutronCase/system/pidUNeDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      pidUNeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


default
{
    controlMode average;
    jGoal 3000; 

    Kp 0.0007e-2; 
    Ki 0;
    dUmax 0.1;

    Umin -10;
    Umax -1.45;

    updateEveryNTimeSteps 2;
    verbose off;

    // set true only when you want to re-init/re-zero integral
    resetController false;
    
    firstControllerUpdateSkip   true;
}


